
# Создать массив из N нулей

n = int(input())
a = [0]*n
print(a)