
# Создать массив от 0 до N

n = int(input())

a = []
for i in range(n+1):
    a.append(i)

print(a)